package com.ID_naming_conventions;

public class conventions {
    public static void main(String[] args) {

    }

}

/*
 * 什么是标识符
 * 就是程序员在定义java程序时，自定义的一些名字。标识符可以应用在类名、变量、函数名、包名上。
 * 
 * 标识符必须遵循以下规则：
 * 标识符由26个英文字符大小写（a~zA~Z）、数字(0~9)、下划线(_)和美元符号($)组成。
 * 不能以数字开头，不能是关键字
 * 严格区分大小写
 * 标识符的可以为任意长度
 * 
 * Java中的标识符命名规范
 * 1. 包名
 * 多个单词组成时所有字母小写（例:package com.baidu）
 * 
 * 2. 类名和接口
 * 
 * 多个单词组成时所有单词的首字母大写(例：HelloWorld)
 * 
 * 3. 变量名和函数名
 * 
 * 多个单词组成时第一个单词首字母小写，其他单词首字母大写（例：lastAccessTime、getTime）。
 * 
 * 4. 常量名
 * 
 * 多个单词组成时，字母全部大写，多个单词之间使用_分隔（例：INTEGER_CACHE）
 * 
 * 注意：只是为了增加规范性、可读性而做的一种约定，标识符在定义的时候最好见名知意，提高代码阅读性。
 */